app/views/users/show.html.erb

    <li>L'utilisateur vit à <%=@user.city.name%></li>
    <li>L'utilisateur a écrit <%=@user.gossips.count%> gossip(s)</li>
    <li>L'utilisateur a donné <%=@user.likes.count%> like(s)</li>
---
SELECT COUNT(*) FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 20]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 20]]