app/controllers/comments_controller.rb

  def create
    # @comment = Comment.new(title: params[:Comment][:title], content: params[:Comment][:content], user_id: params[:Comment][:user_id]) # avec xxx qui sont les données obtenues à partir du formulaire
    @comment = Comment.new(post_params)
    if @comment.save # essaie de sauvegarder en base @comment
---
INSERT INTO "comments" ("content", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "fsdfsdf"], ["commentable_type", "Comment"], ["commentable_id", 121], ["user_id", 53], ["created_at", "2021-11-04 23:21:20.466640"], ["updated_at", "2021-11-04 23:21:20.466640"]]

  def update
    @comment = Comment.find(params[:id])
    @comment.update(post_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 161], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "fsdfsdffdfs"], ["updated_at", "2021-11-04 23:25:33.967672"], ["id", 161]]