app/controllers/gossips_controller.rb

  def create
    # @gossip = Gossip.new(title: params[:gossip][:title], content: params[:gossip][:content], user_id: params[:gossip][:user_id]) # avec xxx qui sont les données obtenues à partir du formulaire
    @gossip = Gossip.new(post_params)
    if @gossip.save # essaie de sauvegarder en base @gossip
---
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Bitchman"], ["content", "Just here to tell you i can kick your ass"], ["user_id", 27], ["created_at", "2021-11-04 20:54:39.191402"], ["updated_at", "2021-11-04 20:54:39.191402"]]

  def update
    @gossip = Gossip.find(params[:id])
    @gossip.update(post_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "hjgkjhl"], ["content", "gvgljkhlhlk"], ["updated_at", "2021-11-04 20:18:13.265163"], ["id", 44]]