app/controllers/users_controller.rb

INSERT INTO "users" ("name", "city_id", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    puts params[:user]
    # @user = User.new(name: params[:user][:name], password: params[:user][:password], city_id: params[:user][:city_id]) # avec xxx qui sont les données obtenues à partir du formulaire
    @user = User.new(post_params)
    if @user.save # essaie de sauvegarder en base @gossip